[
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/YUYWECS3",
		"type": "article-journal",
		"title": "Improving the Performance of Semantic Web Services Discovery: Shortest Path based Approach",
		"container-title": "International Journal of Information Technology and Computer Science",
		"page": "32-39",
		"volume": "6",
		"issue": "7",
		"source": "DOI.org (Crossref)",
		"abstract": "Service discovery is the process of retrieving the service most similar to the query based on the description of functional and/or non-functional semantics. The original algorithm used in literature was proposed by Paolucci et al., 2002. Some research works, propose an extension or an improvement of this algorithm to correct the matchmaking used. In this paper we present an algorithm of matchmaking that resolves the problems of Paolucci algorithm by using the shortest path algorithm which determines the optimal matching between user query and provider service. This approach is validated within a framework proposed at the end of this paper and compared with the greedy approach and the bipartite graph based matching.",
		"URL": "http://www.mecs-press.org/ijitcs/ijitcs-v6-n7/v6n7-5.html",
		"DOI": "10.5815/ijitcs.2014.07.05",
		"ISSN": "20749007, 20749015",
		"title-short": "Improving the Performance of Semantic Web Services Discovery",
		"journalAbbreviation": "IJITCS",
		"language": "en",
		"author": [
			{
				"family": "Khater",
				"given": "Maamar"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2014",
					6,
					8
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/QVEXVYKN",
		"type": "article-journal",
		"title": "Formal method-based behaviour for semantic web services discovery",
		"container-title": "International Journal of Web Science",
		"page": "203-217",
		"volume": "2",
		"issue": "4",
		"source": "inderscienceonline.com (Atypon)",
		"abstract": "The effectiveness and reliability of IS-based web services becomes a critical factor in business success. Known classical problems in the field of web services are imposed implicitly in the design and implementation of such systems, namely: description process of web service, publication process, discovery process, composition process, selection process, substitution, and adaptation process. The approach proposed in this paper allows the realisation of discovery and adaptation tasks based on the behavioural aspect of semantic web services. In this paper, we propose a new behaviour model for semantic web services using automata. The formal model used to specify the process of semantic web services is typed interface and weighted automaton (TIWA) with an operational semantics associated with different action necessary in the implementation of all the algorithms proposed in this paper.",
		"URL": "https://www.inderscienceonline.com/doi/abs/10.1504/IJWS.2014.070669",
		"DOI": "10.1504/IJWS.2014.070669",
		"ISSN": "1757-8795",
		"journalAbbreviation": "International Journal of Web Science",
		"author": [
			{
				"family": "Khater",
				"given": "Maamar"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2014",
					1,
					1
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/SCFF758F",
		"type": "article-journal",
		"title": "Empirical Study for Semantic Annotation of Web Services",
		"container-title": "International Journal of Networked and Distributed Computing",
		"page": "35-44",
		"volume": "2",
		"issue": "1",
		"source": "www.atlantis-press.com",
		"abstract": "Web services have become the main paradigm for the development of distributed software systems using a common set of technologies, including SOAP, WSDL and UDDI. This allows accessing to software components residing on different platforms and written in different programming languages. However, several tasks, including service discovery and composition,...",
		"URL": "https://www.atlantis-press.com/journals/ijndc/10863",
		"DOI": "10.2991/ijndc.2014.2.1.4",
		"ISSN": "2211-7946",
		"language": "en",
		"author": [
			{
				"family": "Bouchiha",
				"given": "Djelloul"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			},
			{
				"family": "Djaa",
				"given": "Djihad"
			},
			{
				"family": "Alghamdi",
				"given": "Abdullah"
			},
			{
				"family": "Alnafjan",
				"given": "Khalid"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2014",
					1
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/98PZ5ABU",
		"type": "article",
		"title": "Mostefai.pdf",
		"URL": "http://rdoc.univ-sba.dz/bitstream/123456789/1448/1/Mostefai.pdf",
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/KE6Z7H4P",
		"type": "article-journal",
		"title": "From User's Goal to Semantic Web Services Discovery: Approach Based on Traceability",
		"container-title": "International Journal of Information Technology and Web Engineering (IJITWE)",
		"page": "15-39",
		"volume": "9",
		"issue": "3",
		"source": "www.igi-global.com",
		"abstract": "From User's Goal to Semantic Web Services Discovery: Approach Based on Traceability: 10.4018/ijitwe.2014070102: The growing number of the Web Services available on the Web without explicit associated semantic descriptions raises a new and challenging research problem",
		"URL": "https://www.igi-global.com/article/from-users-goal-to-semantic-web-services-discovery/123182",
		"DOI": "10.4018/ijitwe.2014070102",
		"ISSN": "1554-1045 DOI: 10.4018/ijitwe.2014070102",
		"title-short": "From User's Goal to Semantic Web Services Discovery",
		"journalAbbreviation": "IJITWE",
		"language": "en",
		"author": [
			{
				"family": "Bouhissi",
				"given": "Houda",
				"dropping-particle": "el"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			},
			{
				"family": "Cherif",
				"given": "Mohamed Amine Sidi Ali"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2014",
					7,
					1
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/9EDPGVJS",
		"type": "article-journal",
		"title": "Composing Data Services with Uncertain Semantics",
		"container-title": "IEEE Transactions on Knowledge and Data Engineering",
		"page": "936-949",
		"volume": "27",
		"issue": "4",
		"source": "IEEE Xplore",
		"abstract": "With the emergence of the open data movement, hundreds of thousands of datasets from various concerns are now freely available on the Internet. The access to a good number of these datasets is carried out through Web services which provide a standard way to interact with data. In this context, user's queries often require the composition of multiple data Web services to be answered. Defining the semantics of data services is the first step towards automating their composition. An interesting approach to define the semantics of data services is by describing them as semantic views over a domain ontology. However, defining such semantic views cannot always be done with certainty, especially when the service's outputs are too complex. In this paper, we propose a probabilistic approach to model the semantics uncertainty of data services. In our approach, a data service with an uncertain semantics is described by several possible semantic views, each one is associated with a probability. Services along with their possible semantic views are represented in a Block-Independent-Disjoint (noted BID) probabilistic service registry, and interpreted based on the Possible Worlds Semantics. Based on our modeling, we study the problem of interpreting an existing composition involving services with uncertain semantics. We also study the problem of compositing uncertain data services to answer a user query, and propose an efficient method to compute the different possible compositions and their probabilities.",
		"DOI": "10.1109/TKDE.2014.2359661",
		"ISSN": "1041-4347, 1558-2191, 2326-3865",
		"author": [
			{
				"family": "Malki",
				"given": "Abdelhamid"
			},
			{
				"family": "Barhamgi",
				"given": "Mahmoud"
			},
			{
				"family": "Benslimane",
				"given": "Sidi-Mohamed"
			},
			{
				"family": "Benslimane",
				"given": "Djamal"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2015",
					4
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/N8GEUZF6",
		"type": "paper-conference",
		"title": "Semantic Web Service ontology construction: A reverse engineering approach",
		"container-title": "2014 IEEE/ACS 11th International Conference on Computer Systems and Applications (AICCSA)",
		"page": "161-168",
		"source": "IEEE Xplore",
		"event": "2014 IEEE/ACS 11th International Conference on Computer Systems and Applications (AICCSA)",
		"abstract": "The Semantic Web Services (SWS) technology is used to describe the Web services' capabilities and content in a computer-interpretable language and improve the quality of existing tasks, such as Web Services discovery, invocation, composition and monitoring. This paper addresses the topic of defining a knowledge based system for representing Semantic Web Service ontologies according to the WSMO-Lite conceptual model and proposes a software engineering approach to this problem using an existing Web Service (WS). The proposal uses a reverse engineering technique supported by a tool and a similarity measure starting from a Web Service Description Language (WSDL) File of an existing Web Service till modeling WSMO-Lite Ontology specified in the WSML language.",
		"DOI": "10.1109/AICCSA.2014.7073194",
		"note": "ISSN: 2161-5330, 2161-5322",
		"title-short": "Semantic Web Service ontology construction",
		"author": [
			{
				"family": "El Bouhissi",
				"given": "Houda"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2014",
					11
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/5XH4QGHM",
		"type": "paper-conference",
		"title": "Improve Web Service discovery: Goal-based approach",
		"container-title": "2014 IEEE/ACS 11th International Conference on Computer Systems and Applications (AICCSA)",
		"page": "26-33",
		"source": "IEEE Xplore",
		"event": "2014 IEEE/ACS 11th International Conference on Computer Systems and Applications (AICCSA)",
		"abstract": "With the greater number of Web Services (WSs) available on the internet, searching the appropriate WS that fulfills the user needs has become a major challenge. In this paper, we propose a Goal-based framework for Web Services (WSs) discovery. The framework employs matching algorithms and allows searching through a set of Semantic Web Services (SWS)s in order to find the most suitable WS that matches with a user Goal. The proposal is implemented and validated using some test collections and real-world scenarios. Moreover, the experimental results showed that the proposed approach has an efficient impact on the discovery process as a whole.",
		"DOI": "10.1109/AICCSA.2014.7073175",
		"note": "ISSN: 2161-5330, 2161-5322",
		"title-short": "Improve Web Service discovery",
		"author": [
			{
				"family": "El Bouhissi",
				"given": "Houda"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			},
			{
				"family": "Sidi Ali Cherif",
				"given": "Amine"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2014",
					11
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/8FM9TBA9",
		"type": "article-journal",
		"title": "Ontology Partitioning: Clustering Based Approach",
		"container-title": "International Journal of Information Technology and Computer Science",
		"page": "1-11",
		"volume": "7",
		"issue": "6",
		"source": "DOI.org (Crossref)",
		"abstract": "The semantic web goal is to share and integrate data across different domains and organizations. The knowledge representations of semantic data are made possible by ontology. As the usage of semantic web increases, construction of the semantic web ontologies is also increased. Moreover, due to the monolithic nature of the ontology various semantic web operations like query answering, data sharing, data matching, data reuse and data integration become more complicated as the size of ontology increases. Partitioning the ontology is the key solution to handle this scalability issue. In this work, we propose a revision and an enhancement of K-means clustering algorithm based on a new semantic similarity measure for partitioning given ontology into high quality modules. The results show that our approach produces meaningful clusters than the traditional algorithm of K-means.",
		"URL": "http://www.mecs-press.org/ijitcs/ijitcs-v7-n6/v7n6-1.html",
		"DOI": "10.5815/ijitcs.2015.06.01",
		"ISSN": "20749007, 20749015",
		"title-short": "Ontology Partitioning",
		"journalAbbreviation": "IJITCS",
		"language": "en",
		"author": [
			{
				"literal": "EEDIS Laboratory, Djillali Liabes University of Sidi Bel Abbes, Sidi Bel Abbes, 22000, Algeria"
			},
			{
				"family": "Ahmed",
				"given": "Soraya Setti"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			},
			{
				"family": "Benslimane",
				"given": "Sidi Mohamed"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2015",
					5,
					8
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/FVQZTTR2",
		"type": "thesis",
		"title": "Linked-Data dans les entreprises.",
		"genre": "Thesis",
		"source": "rdoc.univ-sba.dz",
		"abstract": "Le Web sémantique a vu une augmentation de la disponibilité et de l'utilisation de bases de connaissances au cours des dernières années, en particulier dans l'initiative de Linked Open Data, des\r\nmilliards de déclarations RDF sur Internet, des faits sur une grande variété de domaines, sont prêts à être utilisés par des applications sémantiques, mais malgré cette augmentation, la plupart des jeux de données sont en effet fondés sur des ontologies très simples, tandis que d'autres sont une simple\r\ncollection de faits sans une structure claire. Cependant, les ontologies (ou de manière générale «schémas») dérivées à partir des sources RDF peuvent également apporter des avantages importants pour le Web de données. Ils peuvent aider à faciliter l'intégration, l'interrogation et l'entretien des ensembles de données RDF.\r\nDans ce mémoire, nous proposons une approche basée sur l’analyse de concepts formels (ACF) et la découverte des règles d’association pour l'induction des schémas expressifs (ontologies) à partir de\r\ngrands dépôts RDF, ceci permet de façon semi-automatique de créer des ontologies avec presque tous les types d’axiomes du profile EL d’OWL 2.",
		"URL": "http://rdoc.univ-sba.dz:8080/jspui/handle/123456789/784",
		"language": "fr",
		"author": [
			{
				"family": "Khiati",
				"given": "Nadri"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2014",
					12,
					17
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/5DWXFBE8",
		"type": "article-journal",
		"title": "Question Answering Systems: Survey and Trends",
		"container-title": "Procedia Computer Science",
		"collection-title": "International Conference on Advanced Wireless Information and Communication Technologies (AWICT 2015)",
		"page": "366-375",
		"volume": "73",
		"source": "ScienceDirect",
		"abstract": "The need to query information content available in various formats including structured and unstructured data (text in natural language, semi-structured Web documents, structured RDF data in the semantic Web, etc.) has become increasingly important. Thus, Question Answering Systems (QAS) are essential to satisfy this need. QAS aim at satisfying users who are looking to answer a specific question in natural language. In this paper we survey various QAS. We give also statistics and analysis. This can clear the way and help researchers to choose the appropriate solution to their issue. They can see the insufficiency, so that they can propose new systems for complex queries. They can also adapt or reuse QAS techniques for specific research issues.",
		"URL": "http://www.sciencedirect.com/science/article/pii/S1877050915034663",
		"DOI": "10.1016/j.procs.2015.12.005",
		"ISSN": "1877-0509",
		"title-short": "Question Answering Systems",
		"journalAbbreviation": "Procedia Computer Science",
		"language": "en",
		"author": [
			{
				"family": "Bouziane",
				"given": "Abdelghani"
			},
			{
				"family": "Bouchiha",
				"given": "Djelloul"
			},
			{
				"family": "Doumi",
				"given": "Noureddine"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2015",
					1,
					1
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/NI67CCX9",
		"type": "thesis",
		"title": "Utilisation des Ontologies dans la Catégorisation de Textes Multilingues",
		"genre": "Thesis",
		"source": "rdoc.univ-sba.dz",
		"abstract": "L’objectif de la catégorisation de textes multilingues est de permettre l’assignation d’une ou plusieurs catégories parmi une liste prédéfinie aux textes multilingues. La solution la plus directe consiste a traduire tout les documents vers une seule langue. Néanmoins, cette solution souffre de l’imprécision des techniques de traduction automatique. Les travaux de cette thèse s’inscrivent dans la problématique générale liée à l’utilisation des ontologies pour la catégorisation de textes multilingues.\r\n\r\nDans notre première contribution, nous proposons une nouvelle approche de catégorisation multilingue intégrant les ontologies dans la phase de représentation comme moyen pour réduire les\r\ndistorsions d’information causées par les traducteurs. L’idée consiste a mapper les traductions générées via les concepts de l’ontologie monolingue utilisée.\r\n\r\nDans la deuxième contribution, nous proposons une extension de la première approche qui se base sur l’utilisation des ontologies multilingues afin d’éviter l’utilisation des techniques de traduction automatique. \r\n\r\nDans nos expérimentations, nous utilisons le Princeton WordNet ainsi que le WordNet Espagnol pour évaluer les deux approches proposées sur deux corpus bilingues Anglais-Espagnol. Les résultats obtenus montrent une nette amélioration par rapport a l’approche basée sur la traduction automatique.",
		"URL": "http://rdoc.univ-sba.dz:8080/jspui/handle/123456789/1106",
		"language": "other",
		"author": [
			{
				"family": "Bentaallah",
				"given": "Mohamed Amine"
			},
			{
				"family": "Encadreur: MALKI",
				"given": "Mimoun"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2015",
					6,
					29
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/WQGTWQH9",
		"type": "article",
		"title": "EL-BOUHISSI_Houda.pdf",
		"URL": "http://rdoc.univ-sba.dz/bitstream/123456789/1146/1/EL-BOUHISSI_Houda.pdf",
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/AE3VFRTZ",
		"type": "article",
		"title": "CHAIEB-Yazid.pdf",
		"URL": "http://rdoc.univ-sba.dz/bitstream/123456789/303/1/CHAIEB-Yazid.pdf",
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/DCB95JTU",
		"type": "article",
		"title": "IT4OD-2014-Proceedings-Tebessa.pdf",
		"URL": "https://www.researchgate.net/profile/Hayet_Farida_Merouani/publication/269094681_IT4OD_2014_Proceedings_Tebessa/links/547f3a760cf2de80e7cc7a79/IT4OD-2014-Proceedings-Tebessa.pdf#page=156",
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/FPJ2XQX5",
		"type": "article",
		"title": "KHATER_D_INF.pdf",
		"URL": "http://rdoc.univ-sba.dz/bitstream/123456789/424/1/KHATER_D_INF.pdf",
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/TIFAC5XL",
		"type": "paper-conference",
		"title": "Genetic programming and one-class classification for discovering useful spectral transformations",
		"container-title": "2015 IEEE International Geoscience and Remote Sensing Symposium (IGARSS)",
		"page": "425-428",
		"source": "IEEE Xplore",
		"event": "2015 IEEE International Geoscience and Remote Sensing Symposium (IGARSS)",
		"abstract": "This work presents a new approach for automatic discovering of useful spectral transformations in remotely sensed imagery. The method applies an approach based on One-class classification, ISODATA unsupervised classification and Genetic Programming (GP) to combine spectral bands. Experiments on burned areas extraction from Landsat8-Oli images show that the proposed method yields better results than the traditional spectral transformations.",
		"DOI": "10.1109/IGARSS.2015.7325791",
		"note": "ISSN: 2153-6996, 2153-7003",
		"author": [
			{
				"family": "Djerriri",
				"given": "Khelifa"
			},
			{
				"family": "Mimoun",
				"given": "Malki"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2015",
					7
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/222FYAKC",
		"type": "paper-conference",
		"title": "Fuzzy ontologies for semantic interpretation of remotely sensed images",
		"container-title": "Image and Signal Processing for Remote Sensing XXI",
		"publisher": "International Society for Optics and Photonics",
		"page": "96432F",
		"volume": "9643",
		"source": "www.spiedigitallibrary.org",
		"event": "Image and Signal Processing for Remote Sensing XXI",
		"abstract": "Object-based image classification consists in the assignment of object that share similar attributes to object categories. To perform such a task the remote sensing expert uses its personal knowledge, which is rarely formalized. Ontologies have been proposed as solution to represent domain knowledge agreed by domain experts in a formal and machine readable language. Classical ontology languages are not appropriate to deal with imprecision or vagueness in knowledge. Fortunately, Description Logics for the semantic web has been enhanced by various approaches to handle such knowledge. This paper presents the extension of the traditional ontology-based interpretation with fuzzy ontology of main land-cover classes in Landsat8-OLI scenes (vegetation, built-up areas, water bodies, shadow, clouds, forests) objects. A good classification of image objects was obtained and the results highlight the potential of the method to be replicated over time and space in the perspective of transferability of the procedure.",
		"URL": "https://www.spiedigitallibrary.org/conference-proceedings-of-spie/9643/96432F/Fuzzy-ontologies-for-semantic-interpretation-of-remotely-sensed-images/10.1117/12.2195071.short",
		"DOI": "10.1117/12.2195071",
		"author": [
			{
				"family": "Djerriri",
				"given": "Khelifa"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2015",
					10,
					15
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/EEPZ4HWT",
		"type": "article",
		"title": "Proceeding_ICNTC_2015.pdf",
		"URL": "https://www.univ-chlef.dz/ICNTC/icntc2014/Proceeding_ICNTC_2015.pdf#page=132",
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/UGVUIQSB",
		"type": "paper-conference",
		"title": "Using text mining to locate concepts in execution traces",
		"container-title": "2015 IEEE/ACS 12th International Conference of Computer Systems and Applications (AICCSA)",
		"page": "1-6",
		"source": "IEEE Xplore",
		"event": "2015 IEEE/ACS 12th International Conference of Computer Systems and Applications (AICCSA)",
		"abstract": "Concept location is a key activity during software modernization since it allows maintainers to exactly determine what pieces of source code support a specific concept. When concepts supported by an information system are getting outdated or misaligned, concept location becomes a time-consuming and error-prone task. Moreover, information systems embed significant business knowledge over time that is neither present nor documented anywhere else. For this reason, this paper proposes an approach to locate concepts in execution traces, which contain the actual and current information derived from the execution of the existing code. This approach, based on text segmentation tools, first retrieves and depicts relevant information from the execution traces, and then, it provides a mapping between such information and particular pieces of source code. The main idea of the approach is to take the file of the trace as text where the content of each function (i.e., method) appearing in the trace is a sentence composing the text and then applying the C99 algorithm to segment the text to a thematically coherent segments. The C99 is the state of the art algorithm proposed in text mining community to segment natural text. Each produced segment is composed by a set of functions or methods and bears a concept. Also, under this idea all techniques, proposed by text mining community, for text segmentation will be accessible to the software evolution community. We evaluated our approach on different execution scenarios of JHotDraw and ArgoUML.",
		"DOI": "10.1109/AICCSA.2015.7507122",
		"note": "ISSN: 2161-5330",
		"author": [
			{
				"family": "Abdelkader",
				"given": "Mostefai"
			},
			{
				"family": "Perez-Castillo",
				"given": "Ricardo"
			},
			{
				"family": "Mimoun",
				"given": "Malki"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2015",
					11
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/TTK3CHER",
		"type": "article-journal",
		"title": "SQUIREL: Semantic Querying Interlinked OWL-S traveling Process Models",
		"container-title": "International Journal of Information Technology and Computer Science",
		"page": "30-39",
		"volume": "7",
		"issue": "12",
		"source": "DOI.org (Crossref)",
		"abstract": "With the advent of new forms of information and communication technologies, the consumer needs to combine and customize different travel components as a complete travel package, namely: Dynamic Packaging Technology. Nevertheless, disparate tourist offers and services make it difficult for consumer to use them effectively. Therefore, our paper presents an intelligent querying framework of OWL-S travel services, called SQUIREL composition engine. It uses Semantic Web Services (SWSs) technologies combined with the useful of Linked e-tourism Data concept to fulfill the preferences and constraints of the e-tourist any time. This purpose supports SWSs pre-selection through the valuation of the rewritten SPARQL consumer query at runtime that manages dynamic service dependencies extracted from Linked e-tourism Data and returns the SWSs endpoint. Then, SQUIREL catches this endpoint and makes the necessary optimizations to refine it to its relevant atomic processes needed to be composed using matrix computation. However, the experimental results indicate that this method owns both lower computation cost and higher success ratio of fine-grained discoverybased atomic processes composition.",
		"URL": "http://www.mecs-press.org/ijitcs/ijitcs-v7-n12/v7n12-4.html",
		"DOI": "10.5815/ijitcs.2015.12.04",
		"ISSN": "20749007, 20749015",
		"title-short": "SQUIREL",
		"journalAbbreviation": "IJITCS",
		"language": "en",
		"author": [
			{
				"literal": "EEDIS Laboratory, Computer Science Department. Djillali LIABES University, Sidi Bel Abbes, Algeria"
			},
			{
				"family": "Merazi",
				"given": "Afaf"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2015",
					11,
					8
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/YFDE7R7Y",
		"type": "paper-conference",
		"title": "A Framework for Reengineering Web Applications into Linked Data Based on MDA",
		"container-title": "Proceedings of the International Conference on Intelligent Information Processing, Security and Advanced Communication",
		"collection-title": "IPAC '15",
		"publisher": "ACM",
		"publisher-place": "New York, NY, USA",
		"page": "56:1–56:5",
		"source": "ACM Digital Library",
		"event-place": "New York, NY, USA",
		"abstract": "Currently, the Web became a very enormous resource of data, often hidden in documents. Most of the Web applications represent the data under a structured format, in particularly tables and lists. These data are automatically generated from databases, so they have a restricted access. RDF (Resource Description Framework) offers an effective mechanism, which allows structuring the data on the Web in a simple format, so it makes them directly accessible. In this paper we propose a framework that allows to transform the hidden data on the Web into Linked Data. The framework contains four layers according to MDA (Model Driven Architecture): (1) the layer M0 allows to build a source model from a Web application, (2) layer M1 contains the source model and mapping rules, (3) layer M2 enables to define meta-models of the models included in the layer M1, at the last, (4) layer M3 describes the meta-models using a language of meta-meta-model, such as MOF or ECORE of the framework EMF. At the end of this transformation process, we obtain a target RDF model, which represents data of the Web application.",
		"URL": "http://doi.acm.org/10.1145/2816839.2816880",
		"DOI": "10.1145/2816839.2816880",
		"ISBN": "978-1-4503-3458-7",
		"note": "event-place: Batna, Algeria",
		"author": [
			{
				"family": "Bouougada",
				"given": "Benamar"
			},
			{
				"family": "Bouchiha",
				"given": "Djelloul"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2015"
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/L3PZAL6T",
		"type": "article-journal",
		"title": "Ontology-Alignment Techniques: Survey and Analysis",
		"container-title": "International Journal of Modern Education and Computer Science",
		"page": "67-78",
		"volume": "7",
		"issue": "11",
		"source": "DOI.org (Crossref)",
		"abstract": "The ontology alignment consists in generating a set of correspondences between entities. These entities can be concepts, properties or instances. The ontology alignment is an important task because it allows the joint consideration of resources described by different ontologies. This paper aims at counting all works of the ontology alignment field and analyzing the approaches according to different techniques (terminological, structural, extensional and semantic). This can clear the way and help researchers to choose the appropriate solution to their issue. They can see the insufficiency, so that they can propose new approaches for stronger alignment. They can also adapt or reuse alignment techniques for specific research issues, such as semantic annotation, maintenance of links between entities, etc.",
		"URL": "http://www.mecs-press.org/ijmecs/ijmecs-v7-n11/v7n11-8.html",
		"DOI": "10.5815/ijmecs.2015.11.08",
		"ISSN": "20750161, 2075017X",
		"title-short": "Ontology-Alignment Techniques",
		"journalAbbreviation": "IJMECS",
		"language": "en",
		"author": [
			{
				"literal": "Univ Ctr of El Bayadh, Inst. Science and Technology, Algeria"
			},
			{
				"family": "Ardjani",
				"given": "Fatima"
			},
			{
				"family": "Bouchiha",
				"given": "Djelloul"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2015",
					11,
					8
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/84KLIY45",
		"type": "paper-conference",
		"title": "Clone detection using time series and dynamic time warping techniques",
		"container-title": "2015 Third World Conference on Complex Systems (WCCS)",
		"page": "1-6",
		"source": "IEEE Xplore",
		"event": "2015 Third World Conference on Complex Systems (WCCS)",
		"abstract": "This paper presents a novel approach to detect code clones. The proposed approach formulates the clone detection problem as a problem of querying and mining time series data [18]. The approach is composed of three steps. The first step extracts modules (i.e., methods, functions...) from the software system, the second transforms modules to time series and the third one calculates the similarity degree between modules using the DTW (i.e., Dynamic Time Warping) algorithm. Two modules are reported as clones if the DTW similarity value between them is greater than some predefined threshold. The results of the experiment conducted on well known software systems shown that our approach has the potential to detect clones of type I, type II and type III in an effective manner.",
		"DOI": "10.1109/ICoCS.2015.7483299",
		"author": [
			{
				"family": "Abdelkader",
				"given": "Mostefai"
			},
			{
				"family": "Mimoun",
				"given": "Malki"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2015",
					11
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/R48DINWS",
		"type": "article-journal",
		"title": "Data Services with uncertain and correlated semantics",
		"container-title": "World Wide Web",
		"page": "157-175",
		"volume": "19",
		"issue": "1",
		"source": "Springer Link",
		"abstract": "Currently, a good portion of datasets on Internet are accessed through data services, where user’s queries are answered as a composition of multiple data services. Defining the semantics of data services is the first step towards automating their composition. An interesting approach to define the semantics of data services is by describing them as semantic views over a domain ontology. However, defining such semantic views cannot always be done with certainty, especially when the service’s returned data are too complex. In such case, a data service is associated with several possible semantic views. In addition, complex correlations may be present among these possible semantic views, mainly when data services encapsulate the same data sources. In this paper, we propose a probabilistic approach to model the semantic uncertainty of data services. Services along with their possible semantic views are represented in probabilistic service registry. The correlations among service semantics are modeled through a directed probabilistic graphical model (Bayesian network). Based on our modeling, we study the problem of compositing correlated data services to answer a user query, and propose an efficient method to compute the different possible compositions and their probabilities.",
		"URL": "https://doi.org/10.1007/s11280-014-0317-x",
		"DOI": "10.1007/s11280-014-0317-x",
		"ISSN": "1573-1413",
		"journalAbbreviation": "World Wide Web",
		"language": "en",
		"author": [
			{
				"family": "Malki",
				"given": "Abdelhamid"
			},
			{
				"family": "Benslimane",
				"given": "Djamal"
			},
			{
				"family": "Benslimane",
				"given": "Sidi-Mohamed"
			},
			{
				"family": "Barhamgi",
				"given": "Mahmoud"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			},
			{
				"family": "Ghodous",
				"given": "Parisa"
			},
			{
				"family": "Drira",
				"given": "Khalil"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2016",
					1,
					1
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/8GRRI8YB",
		"type": "article-journal",
		"title": "An effective and time-efficient approach for Linked Data fusion using genetic algorithms",
		"container-title": "International Journal of Metadata, Semantics and Ontologies",
		"page": "110-123",
		"volume": "11",
		"issue": "2",
		"source": "inderscienceonline.com (Atypon)",
		"abstract": "The Linked Open Data Cloud is a project that uses RDF formalism to publish data in the form of a triple on the web under open licence. With the ever increasing amount of data sets available in the LOD Cloud, it is already beyond the human capability to integrate heterogeneous data manually. So far, the task of Linked Data fusion entails a significant amount of time owing to the large number of instances in the data sets from the LOD Cloud. In this paper, we suggest a new system to efficiently combine heterogeneous data from the LOD Cloud. First, we extract similar instances from the LOD Cloud to identify identical or related information. Then, our system collects all predicates and objects of the similar instances to construct a set of trees. Finally, we propose a genetic algorithm to merge data in the constructed trees. In the following, we give an overview of our system architecture and we detail our genetic algorithm. We also evaluate our system using real data sets showing that it can increase the completeness and the conciseness in data fusion. Moreover, we prove that our system is faster when fusing large data sets from the LOD Cloud.",
		"URL": "https://www.inderscienceonline.com/doi/abs/10.1504/IJMSO.2016.080349",
		"DOI": "10.1504/IJMSO.2016.080349",
		"ISSN": "1744-2621",
		"journalAbbreviation": "International Journal of Metadata, Semantics and Ontologies",
		"author": [
			{
				"family": "Bencherif",
				"given": "Khayra"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2016",
					1,
					1
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/9U6ZJZEH",
		"type": "article-journal",
		"title": "Kernel Contraction and Consolidation of Alignment under Ontology Change",
		"container-title": "International Journal of Information Technology and Computer Science",
		"page": "31-42",
		"volume": "8",
		"issue": "8",
		"source": "DOI.org (Crossref)",
		"abstract": "Alignment overcomes divergence in the specification of the semantics of vocabularies by different but overlapping ontologies. Therefore, it enhances semantic interoperability for many web based applications. However, ontology change following applications new requirements or new perception of domain knowledges can leads to undesirable knowledge such as inconsistent and therefore to a useless alignment. Ontologies and alignments are encoded in knowledge bases allowing applications to store only some explicit knowledge while they derive implicit ones by applying reasoning services on these knowledge bases. This underlying representation of ontologies and alignments leads us to follow base revision theory to deal with alignment revision under ontology change. For that purpose, we adapt kernel contraction framework to design rational operators and to formulate the set of postulates that characterize each class of these operators. We demonstrate the connection between each class of operators and the set of postulates that characterize them. Finally, we present algorithms to compute alignment kernels and incision functions. Kernels are sets of correspondences responsible of undesirable knowledge following alignment semantics. Incision functions determine the sets of correspondences to eliminate in order to restore alignment consistency or to realize a successful contraction.",
		"URL": "http://www.mecs-press.org/ijitcs/ijitcs-v8-n8/v8n8-4.html",
		"DOI": "10.5815/ijitcs.2016.08.04",
		"ISSN": "20749007, 20749015",
		"journalAbbreviation": "IJITCS",
		"language": "en",
		"author": [
			{
				"literal": "University of Dr Moulay Tahar, Saida, Algeria, EDIS Laboratory, University of Djillali Liabès, Sidi BEL-ABBES, Algeria"
			},
			{
				"family": "Zahaf",
				"given": "Ahmed"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2016",
					8,
					8
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/8ZGLKYAC",
		"type": "thesis",
		"title": "Construction d’Ontologies Modulaires : Approche Basée sur le Clustering",
		"genre": "Thesis",
		"source": "rdoc.univ-sba.dz",
		"abstract": "Le web sémantique a pour but le partage et l’intégration des données issues de domaines  et d’organisations différents.\r\nLes ontologies présentent un savoir préalable requis pour un traitement systématique de l’information à des fins de navigation, de rappel, de précision, En outre les ontologies sont considérées comme étant des structures efficaces pour la représentation des connaissances du domaine. \r\nLe champ d’application des ontologies ne cesse de s’élargir et couvre les systèmes conseillers (systèmes d’aide à la décision, systèmes d’enseignement assisté par ordinateur – e-Learning –, etc.), les systèmes de résolution de problèmes et les systèmes de gestion de connaissances (par exemple dans le domaine du biomédical). Un des plus grands projets basé sur l’utilisation des ontologies consiste à ajouter au Web une véritable couche de connaissances permettant, dans un premier temps, la recherche d’information aussi bien au niveau syntaxique qu’au niveau sémantique.\r\nEt comme l’usage du web sémantique est en pleine expansion le besoin des ontologies est devenu incontournable. Toutefois, les ontologies sont confrontées de façon continue à un problème d’évolution et de complexité. Donc plusieurs opérations du web sémantique  comme la réponse aux requêtes, le partage, l’intégration des données l’alignement deviennent des tâches plus difficiles.  Avec la complexité des ontologies et la taille plus grande. Partitionner l’ontologie en plusieurs modules est une solution   à ces problèmes. \r\nDans cette thèse nous proposons une approche de  partitionnement de l'ontologie.  C’est une amélioration et révision de l’approche de clustering K-means bâtie sur une nouvelle mesure de similarité  pour partitionner une ontologie à plusieurs partitions.\r\nLes résultats obtenus montrent que  notre approche génère les meilleurs résultats en comparant avec celle  de K-means standard.",
		"URL": "http://rdoc.univ-sba.dz:8080/jspui/handle/123456789/1293",
		"title-short": "Construction d’Ontologies Modulaires",
		"language": "fr",
		"author": [
			{
				"family": "Setti Ahmed",
				"given": "Soraya"
			},
			{
				"family": "Encadreur: MALKI",
				"given": "Mimoun"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2016",
					1,
					14
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/QADHHV6H",
		"type": "article-journal",
		"title": "Alignment Evolution under Ontology Change",
		"container-title": "International Journal of Information Technology and Web Engineering (IJITWE)",
		"page": "14-38",
		"volume": "11",
		"issue": "2",
		"source": "www.igi-global.com",
		"abstract": "Alignment Evolution under Ontology Change: 10.4018/IJITWE.2016040102: The alignment of ontologies is the backbone of semantic interoperability. It facilitates the import of data from an ontology to another, translating queries",
		"URL": "https://www.igi-global.com/article/alignment-evolution-under-ontology-change/159156",
		"DOI": "10.4018/IJITWE.2016040102",
		"ISSN": "1554-1045 DOI: 10.4018/IJITWE.2016040102",
		"journalAbbreviation": "IJITWE",
		"language": "en",
		"author": [
			{
				"family": "Zahaf",
				"given": "Ahmed"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2016",
					4,
					1
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/U3PNUYN5",
		"type": "paper-conference",
		"title": "Web Services Matchmaking Based on a Partial Ontology Alignment Aissa FELLAH",
		"source": "Semantic Scholar",
		"abstract": "The fast development and the huge number of existing web services have raised the problem of the urgent need for matchmaking mechanisms. However state-of-the-art matchmakers are unsuitable for locating web services that use different ontologies. This aspect is important since it is not realistic to assume that Web services will always be defined by the same ontology, as the Web service requester and provider operate independently, each defines their own ontologies to describe their services. This is an emergent research issue that has not been well addressed. This work is a contribution to achieve semantic interoperability in a multi-ontology environment. This paper describes a Web service multi-ontology matchmaker for SAWSDL services, called SAWSDL-MOM which locates web services that use different ontologies. The matchmaker engine incorporates a novel partial ontology alignment algorithm with syntax, linguistic and original structural matchers. In determining the 1:1 mappings the Hungarian algorithm is used. Finally a matchmaking strategy is utilized in finding the score of each service. Experimental evaluation and comparison provide strong evidence that SAWSDL-MOM can significantly improve results, achieve better interoperability and scalability.",
		"DOI": "10.5815/ijitcs.2016.06.02",
		"author": [
			{
				"family": "Fellah",
				"given": "Aissa"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			},
			{
				"family": "Elçi",
				"given": "Atilla"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2016"
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/XKUD9MXE",
		"type": "webpage",
		"title": "CSDL | IEEE Computer Society",
		"URL": "https://www.computer.org/csdl/proceedings-article/csit/2016/07549450/null",
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/6D53JX6V",
		"type": "article-journal",
		"title": "A Novel Approach to Construct Semantic Mashup using Patterns",
		"container-title": "International Journal of Information Technology and Web Engineering (IJITWE)",
		"page": "19-36",
		"volume": "12",
		"issue": "1",
		"source": "www.igi-global.com",
		"abstract": "A Novel Approach to Construct Semantic Mashup using Patterns: 10.4018/IJITWE.2017010102: With the coming of Web 2.0, several technologies are developed to facilitate creating, sharing and reusing of web resources. In this context, the mashup is a",
		"URL": "https://www.igi-global.com/article/a-novel-approach-to-construct-semantic-mashup-using-patterns/170369",
		"DOI": "10.4018/IJITWE.2017010102",
		"ISSN": "1554-1045 DOI: 10.4018/IJITWE.2017010102",
		"journalAbbreviation": "IJITWE",
		"language": "en",
		"author": [
			{
				"family": "Bencherif",
				"given": "Khayra"
			},
			{
				"family": "Bensaber",
				"given": "Djamel Amar"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2017",
					1,
					1
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/DWTHJZ82",
		"type": "article-journal",
		"title": "Behaviour approach for composite OWL-S services discovery",
		"container-title": "International Journal of Business Information Systems",
		"page": "55-70",
		"volume": "25",
		"issue": "1",
		"source": "inderscienceonline.com (Atypon)",
		"abstract": "Service discovery is the process of retrieving the service most similar to the query based on the description of functional and/or non-functional semantics. The matchmaking based only on service profile (inputs/outputs) is not sufficient in the case of composite services. To overcome profile matching limitations, we propose an approach-based subgraph isomorphism to check the matching of process structure between two OWL-S process models of composite services and shortest path (OWLS-SP) to compute the score of matching between nodes of service and query (atomic services).",
		"URL": "https://www.inderscienceonline.com/doi/abs/10.1504/IJBIS.2017.083276",
		"DOI": "10.1504/IJBIS.2017.083276",
		"ISSN": "1746-0972",
		"journalAbbreviation": "International Journal of Business Information Systems",
		"author": [
			{
				"family": "Khater",
				"given": "Maamar"
			},
			{
				"family": "Habibeche",
				"given": "Salah-Eddine"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2017",
					1,
					1
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/8AHQN9Q4",
		"type": "article-journal",
		"title": "Question answering systems: the story till the Arabic linked data",
		"container-title": "International Journal of Artificial Intelligence and Soft Computing",
		"page": "24",
		"volume": "6",
		"issue": "1",
		"source": "DOI.org (Crossref)",
		"abstract": "Question answering system (QAS) is essential to satisfy the need to query information available in various formats, including structured data (ontology, databases) or unstructured data (document, Web). The QAS provides a correct response to the question asked by a user in natural language. QAS uses Natural Language Processing (NLP) techniques to interface with the system user. In this paper we survey various QAS such as Natural Language Interface to DataBases (NLIDB), Ontology based question answering and Question answering systems for unstructured data. We give also statistics and analysis. This can help researchers to choose an appropriate solution to their issues. In case of insufficiency, they can propose new systems for complex queries and adapt or reuse QAS techniques for specific research issues. We give also our point of view on how can QAS deal with Arabic Linked Data.",
		"URL": "http://www.inderscience.com/link.php?id=10005155",
		"DOI": "10.1504/IJAISC.2017.10005155",
		"ISSN": "1755-4950, 1755-4969",
		"title-short": "Question answering systems",
		"journalAbbreviation": "IJAISC",
		"language": "en",
		"author": [
			{
				"family": "Doumi",
				"given": "Noureddine"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			},
			{
				"family": "Bouchiha",
				"given": "Djelloul"
			},
			{
				"family": "Bouziane",
				"given": "Abdelghani"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2017"
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/AFTT2TKC",
		"type": "paper-conference",
		"title": "Modélisation de préférences à base de croyance du décideur",
		"source": "ResearchGate",
		"abstract": "Dans un contexte OLAP, une grande quantité d'informations est fournie à l'utilisateur. La majorité de ces informations n'est pas intéressante ni utile à l'analyse. Afin de régler ce problème, on a pensé à personnaliser les préférences et les requêtes MDX pour une meilleure satisfaction des besoins décisionnels. Dans cet article une approche quantitative représentée par l'emploi des outils de la théorie de croyance est adoptée pour ce cas en exploitant l'historique de la session utilisateur représentant le fichier log des requêtes entrées précédemment par celui-ci afin de former une expression de préférences.  Mots-clés : OLAP, personnalisation, profil, entrepôts de données, théorie d'évidence.",
		"author": [
			{
				"family": "Abdelmadjid",
				"given": "Larbi"
			},
			{
				"family": "Mimoun",
				"given": "Malki"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2017",
					4,
					27
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/LQNFF7YT",
		"type": "article-journal",
		"title": "On Demand ETL of RDB to RDF Mapping for Linked Enterprise Data",
		"container-title": "International Journal of Strategic Information Technology and Applications (IJSITA)",
		"page": "91-100",
		"volume": "8",
		"issue": "3",
		"source": "www.igi-global.com",
		"abstract": "On Demand ETL of RDB to RDF Mapping for Linked Enterprise Data: 10.4018/IJSITA.2017070106: The purpose of the semantic web goes well beyond a simple provision of raw data: it is a matter of linking data together. This data meshing approach, called",
		"URL": "https://www.igi-global.com/article/on-demand-etl-of-rdb-to-rdf-mapping-for-linked-enterprise-data/209462",
		"DOI": "10.4018/IJSITA.2017070106",
		"journalAbbreviation": "IJSITA",
		"language": "en",
		"author": [
			{
				"family": "Nesrine",
				"given": "Lehireche"
			},
			{
				"family": "Mimoun",
				"given": "Malki"
			},
			{
				"family": "Ahmed",
				"given": "Lehireche"
			},
			{
				"family": "Hamou",
				"given": "Reda Mohamed"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2017",
					7,
					1
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/J3MV8I6W",
		"type": "article-journal",
		"title": "An Approach for Discovering and Maintaining Links in RDF Linked Data",
		"container-title": "International Journal of Modern Education and Computer Science",
		"page": "56-63",
		"volume": "9",
		"issue": "3",
		"source": "DOI.org (Crossref)",
		"abstract": "Many datasets are published on the Web using semantic Web technologies. These datasets contain data that represent links to similar resources. If these datasets are linked together by properly constructed links, users can easily query the data through a uniform interface, as if they were querying a single dataset. In this paper we propose an approach to discover (semi) automatically links between RDF data based on the description models that appear around the resources. Our approach also includes a (semi) automatic process to maintain links when a data-change occurs.",
		"URL": "http://www.mecs-press.org/ijmecs/ijmecs-v9-n3/v9n3-7.html",
		"DOI": "10.5815/ijmecs.2017.03.07",
		"ISSN": "20750161, 2075017X",
		"journalAbbreviation": "IJMECS",
		"language": "en",
		"author": [
			{
				"literal": "EEDIS Laboratory, University of Djillali Liabès, Sidi BEL-ABBES, Algeria"
			},
			{
				"family": "Ardjani",
				"given": "Fatima"
			},
			{
				"family": "Bouchiha",
				"given": "Djelloul"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2017",
					3,
					8
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/X29BGWRU",
		"type": "paper-conference",
		"title": "A Semi-automatic Solution for XML Query Response Enrichment Using a Terminological Domain Ontology",
		"container-title": "Proceedings of the International Conference on Computing for Engineering and Sciences",
		"collection-title": "ICCES '17",
		"publisher": "ACM",
		"publisher-place": "New York, NY, USA",
		"page": "76–81",
		"source": "ACM Digital Library",
		"event-place": "New York, NY, USA",
		"abstract": "The introduction of data semantics in various fields of science by referring to the ontological database is becoming more and more necessary. With the proliferation of domain ontologies and the large volume of data to be processed, it has become necessary to have data management systems based on ontological systems. Such a system can be exploited via the web as is the case with XML databases, which will allow us to: - use semantic databases via the Internet. - To enrich responses to XML queries by using domain terminology ontology. Also, XML present a flexible hierarchical model suitable to represent huge amounts of data with no absolute and fixed schema, In order to highlight the usefulness of introducing the semantics in the XML database and to enrich the answers to the queries, we have proposed a semi-automatic solution that we applied it for pharmaceutical databases, and which gave very encouraging preliminary results.",
		"URL": "http://doi.acm.org/10.1145/3129186.3131941",
		"DOI": "10.1145/3129186.3131941",
		"ISBN": "978-1-4503-5309-0",
		"note": "event-place: Istanbul, Turkey",
		"author": [
			{
				"family": "Abdelmadjid",
				"given": "Larbi"
			},
			{
				"family": "Mimoun",
				"given": "Malki"
			},
			{
				"family": "Bachir",
				"given": "Seddiki"
			},
			{
				"family": "Ismail",
				"given": "Larbi"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2017"
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/F3LALEQN",
		"type": "article-journal",
		"title": "Ontology Authoring and Linked Data Generation from Web Applications",
		"container-title": "International Journal of Strategic Information Technology and Applications (IJSITA)",
		"page": "52-66",
		"volume": "8",
		"issue": "4",
		"source": "www.igi-global.com",
		"abstract": "Ontology Authoring and Linked Data Generation from Web Applications: 10.4018/IJSITA.2017100105: One of the fundamental problems in the development of the semantic web is what is known as the ontology authoring. This process allows the domain expert to",
		"URL": "https://www.igi-global.com/article/ontology-authoring-and-linked-data-generation-from-web-applications/210603",
		"DOI": "10.4018/IJSITA.2017100105",
		"ISSN": "1947-3095 DOI: 10.4018/IJSITA.2017100105",
		"journalAbbreviation": "IJSITA",
		"language": "en",
		"author": [
			{
				"family": "Bouougada",
				"given": "Benamar"
			},
			{
				"family": "Bouchiha",
				"given": "Djelloul"
			},
			{
				"family": "Bouziane",
				"given": "Abdelghani"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2017",
					10,
					1
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/VP8ZTYII",
		"type": "article-journal",
		"title": "An Unsupervised Entity Resolution Framework for English and Arabic Datasets",
		"container-title": "International Journal of Strategic Information Technology and Applications (IJSITA)",
		"page": "16-29",
		"volume": "8",
		"issue": "4",
		"source": "www.igi-global.com",
		"abstract": "An Unsupervised Entity Resolution Framework for English and Arabic Datasets: 10.4018/IJSITA.2017100102: Entity resolution (ER) is an important step in data integration and in many data mining projects; its goal is to identify records that refer to the same",
		"URL": "https://www.igi-global.com/article/an-unsupervised-entity-resolution-framework-for-english-and-arabic-datasets/210600",
		"DOI": "10.4018/IJSITA.2017100102",
		"journalAbbreviation": "IJSITA",
		"language": "en",
		"author": [
			{
				"family": "Ouhab",
				"given": "Abdelkrim"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			},
			{
				"family": "Berrabah",
				"given": "Djamel"
			},
			{
				"family": "Boufares",
				"given": "Faouzi"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2017",
					10,
					1
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/H7KB2BYL",
		"type": "article-journal",
		"title": "Fuzzy Ontology-based Approach for the Requirements Query Imprecision Assessment in Data Warehouse Design Process near Negative Fuzzy Operator",
		"container-title": "International Journal of Information Technology and Computer Science",
		"page": "18-32",
		"volume": "10",
		"issue": "2",
		"source": "DOI.org (Crossref)",
		"abstract": "The vagueness in decision-making may be due to ambiguity in the decisional requirements expression. Therefore, in the literature dealing with vagueness in decision systems, studies were concentrated on data vagueness and not on decision requirements. In order to evaluate the expression in decision-making requirements and in order to improve the data warehouses design quality, this paper presents a rigorous fuzzy ontologybased solution.",
		"URL": "http://www.mecs-press.org/ijitcs/ijitcs-v10-n2/v10n2-3.html",
		"DOI": "10.5815/ijitcs.2018.02.03",
		"ISSN": "20749007, 20749015",
		"journalAbbreviation": "IJITCS",
		"language": "en",
		"author": [
			{
				"literal": "Department of Computer Science, DL University, 22000, Sidi Bel Abbes EEDIS Laboratory, DL University SBA"
			},
			{
				"literal": "Algeria"
			},
			{
				"family": "Abdelmadjid",
				"given": "Larbi"
			},
			{
				"family": "Mimoun",
				"given": "Malki"
			},
			{
				"family": "Kamel",
				"given": "Boukhalfa"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2018",
					2,
					8
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/EBAUIS5N",
		"type": "article-journal",
		"title": "Integrating Heterogeneous Services for Semantic Mashup Construction",
		"container-title": "Handbook of Research on Contemporary Perspectives on Web-Based Systems",
		"page": "362-386",
		"source": "www.igi-global.com",
		"abstract": "Integrating Heterogeneous Services for Semantic Mashup Construction: 10.4018/978-1-5225-5384-7.ch016: Semantic mashup applications allow automating the process of services and data integration to create a composite application with a new user interface.",
		"URL": "https://www.igi-global.com/chapter/integrating-heterogeneous-services-for-semantic-mashup-construction/203431",
		"DOI": "10.4018/978-1-5225-5384-7.ch016",
		"language": "en",
		"author": [
			{
				"family": "Bencherif",
				"given": "Khayra"
			},
			{
				"family": "Bensaber",
				"given": "Djamel Amar"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2018"
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/QWCY8HBL",
		"type": "article-journal",
		"title": "Methods for Ontology Alignment Change",
		"container-title": "Handbook of Research on Contemporary Perspectives on Web-Based Systems",
		"page": "214-239",
		"source": "www.igi-global.com",
		"abstract": "Methods for Ontology Alignment Change: 10.4018/978-1-5225-5384-7.ch011: Different repositories of ontology are available on the web to share common understandings of the knowledge of different domains with semantic web",
		"URL": "https://www.igi-global.com/chapter/methods-for-ontology-alignment-change/203426",
		"DOI": "10.4018/978-1-5225-5384-7.ch011",
		"language": "en",
		"author": [
			{
				"family": "Zahaf",
				"given": "Ahmed"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2018"
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/Q2NXJ9WI",
		"type": "paper-conference",
		"title": "Queries-based Requirements Imprecision Study for Data Warehouse Update Structural Approach",
		"container-title": "Proceedings of the 8th International Conference on Information Systems and Technologies",
		"collection-title": "ICIST '18",
		"publisher": "ACM",
		"publisher-place": "New York, NY, USA",
		"page": "5:1–5:10",
		"source": "ACM Digital Library",
		"event-place": "New York, NY, USA",
		"abstract": "Due to the increasing complexity of Data Warehouse (DW), continuous attention must be paid for evaluation of their quality throughout their design and development [1]. A good requirements model quality may lead to a good DW quality [2]. Various authors have proposed metrics to assure the quality of conceptual, logical and physical models for DW. However, there is no significant work in the DW literature to assure the requirements model quality. Starting from a misinterpretation of fuzzy requirements, all data warehouse conceptions and OLAP analysis ensuing will be wrong. To design a DW model, it is necessary to take into account not only data sources, but also the analysis requirements. Therefore, in the literature they have focused studies on the data inaccuracy but not in queries-based requirements imprecision. In order to evaluate the queries-based requirements imprecision and in order to improve the data warehouse design quality and inspiring Fasel model, this paper presents a naive solution which represent a structural proposition for the update data warehouse case. We're going to apply this proposal in the road accidents risk casee.",
		"URL": "http://doi.acm.org/10.1145/3200842.3200851",
		"DOI": "10.1145/3200842.3200851",
		"ISBN": "978-1-4503-6404-1",
		"note": "event-place: Istanbul, Turkey",
		"author": [
			{
				"family": "Abdelmadjid",
				"given": "Larbi"
			},
			{
				"family": "Mimoun",
				"given": "Malki"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2018"
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/ILMJPPSQ",
		"type": "article-journal",
		"title": "MASHUP of Linked Data and Web API",
		"container-title": "International Journal of Information Technology and Computer Science",
		"page": "64-71",
		"volume": "10",
		"issue": "6",
		"source": "DOI.org (Crossref)",
		"abstract": "Mashups are an important way to allow normal users to build their own applications responding to the specific needs of each one. The basic components of mashups are Data and Web APIs especially Restful ones, but it is difficult for an unexperienced user to combine manually APIs with Data. Therefore, there is a need to predefine links between these resources to permit an easy combination. In this paper, we propose a new approach to make Restful Web APIs adhere to Linked Data principles, which facilitate their combination in mashup applications. The advantage of the proposed approach is the fact that it allows integrating linked data with the composition of Restful APIs, It also uses an algorithm to automatically create links between APIs.",
		"URL": "http://www.mecs-press.org/ijitcs/ijitcs-v10-n6/v10n6-7.html",
		"DOI": "10.5815/ijitcs.2018.06.07",
		"ISSN": "20749007, 20749015",
		"journalAbbreviation": "IJITCS",
		"language": "en",
		"author": [
			{
				"literal": "EEDIS Laboratory, Djillali Liabes University, Sidi Bel Abbes, Algeria"
			},
			{
				"family": "Belfedhal",
				"given": "Mohammed Amine"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2018",
					6,
					8
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/XXDQTS8J",
		"type": "article-journal",
		"title": "Toward an Arabic Question Answering System over Linked Data",
		"container-title": "Jordanian Journal of Computers and Information Technology",
		"page": "102",
		"issue": "0",
		"source": "DOI.org (Crossref)",
		"abstract": "The increasing interest in Arabic natural language processing and semantic Web research involves an emerging need to the development of new Question Answering Systems (QAS). These systems allow users to ask a question in Arabic natural language and get the relevant answer. However, most existing QA systems focused on English and Latin-based languages. Less effort has been concentrated on the Arabic language, which belongs to \"Semitic Languages\". This work is an early version of a new domain-independent Arabic question answering system over linked data, which aims to particularly help Arab users to explore the Arabic Semantic Web based on Arabic ontology. We describe with sufficient details the different modules of our proposed system, which uses language parser, finite state automaton and semantic Web techniques to linguistically process and answer Arabic natural language question. Experiments have been carried out to evaluate and show efficiency of the proposed system.",
		"URL": "https://www.ejmanager.com/fulltextpdf.php?mno=287021",
		"DOI": "10.5455/jjcit.71-1514749838",
		"ISSN": "2413-9351",
		"journalAbbreviation": "JJCIT",
		"language": "en",
		"author": [
			{
				"family": "Bouziane",
				"given": "Abdelghani"
			},
			{
				"family": "Bouchiha",
				"given": "Djelloul"
			},
			{
				"family": "Doumi",
				"given": "Noureddine"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2018"
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/CGBM9QZI",
		"type": "article-journal",
		"title": "Htab2RDF: Mapping HTML Tables to RDF Triples",
		"container-title": "COMPUTING AND INFORMATICS",
		"page": "1467-1491",
		"volume": "36",
		"issue": "6",
		"source": "www.cai.sk",
		"abstract": "The Web has become a tremendously huge data source hidden under linked documents. A significant number of Web documents include HTML tables generated dynamically from relational databases. Often, there is no direct public access to the databases themselves. On the other hand, RDF (Resource Description Framework) gives an efficient mechanism to represent directly data on the Web based on a Web-scalable architecture for identification and interpretation of terms. This leads to the concept of Linked Data on the Web. To allow direct access to data on the Web as Linked Data, we propose in this paper an approach to transform HTML tables into RDF triples. It consists of three main phases: refining, pre-treatment and mapping. The whole process is assisted by a domain ontology and the WordNet lexical database. A tool called Htab2RDF has been implemented. Experiments have been carried out to evaluate and show efficiency of the proposed approach.",
		"URL": "http://www.cai.sk/ojs/index.php/cai/article/view/2017_6_1467",
		"ISSN": "2585-8807",
		"title-short": "Htab2RDF",
		"language": "en",
		"author": [
			{
				"family": "Bouchiha",
				"given": "Djelloul"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			},
			{
				"family": "Alghamdi",
				"given": "Abdullah"
			},
			{
				"family": "Alnafjan",
				"given": "Khalid"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2018",
					2,
					9
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/C539CJDK",
		"type": "article-journal",
		"title": "An Unsupervised Approach for Determining Link Specifications",
		"container-title": "International Journal of Information Technology and Web Engineering (IJITWE)",
		"page": "104-123",
		"volume": "13",
		"issue": "4",
		"source": "www.igi-global.com",
		"abstract": "An Unsupervised Approach for Determining Link Specifications: 10.4018/IJITWE.2018100106: This article describes how the Linked Open Data Cloud project allows data providers to publish structured data on the web according to the Linked Data",
		"URL": "https://www.igi-global.com/article/an-unsupervised-approach-for-determining-link-specifications/209723",
		"DOI": "10.4018/IJITWE.2018100106",
		"journalAbbreviation": "IJITWE",
		"language": "en",
		"author": [
			{
				"family": "Bencherif",
				"given": "Khayra"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			},
			{
				"family": "Bensaber",
				"given": "Djamel Amar"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2018",
					10,
					1
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/GJWM2I5J",
		"type": "paper-conference",
		"title": "Requirements Imprecision of Data Warehouse Design Fuzzy Ontology-Based Approach - Fuzzy Connector Case",
		"container-title": "Proceedings of the 8th International Conference on Sciences of Electronics, Technologies of Information and Telecommunications (SETIT’18), Vol.1",
		"collection-title": "Smart Innovation, Systems and Technologies",
		"publisher": "Springer International Publishing",
		"publisher-place": "Cham",
		"page": "115-122",
		"source": "Springer Link",
		"event-place": "Cham",
		"abstract": "Imprecision in decision systems can negatively affect the data warehouse (DW) quality during a bad interpretation case. In order to evaluate the imprecision expression in decisional requirements and differently to our previous paper, we present an ontological solution using our GLMR ontology model for fuzzy connector evaluation in a query-based requirement. For simplification reasons, we present in this paper only “and if possible” fuzzy connector case. We will propose a new solution combining two recent existent solutions. Although the fuzzy connector assessment was already treated but, according to our knowledge, never in the decision need context and proposing an ontological solution. The preliminary tests of our ontological solution are encouraging.",
		"DOI": "10.1007/978-3-030-21005-2_11",
		"ISBN": "978-3-030-21005-2",
		"language": "en",
		"author": [
			{
				"family": "Larbi",
				"given": "Abdelmadjid"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			}
		],
		"editor": [
			{
				"family": "Bouhlel",
				"given": "Med Salim"
			},
			{
				"family": "Rovetta",
				"given": "Stefano"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2020"
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/YG3YYJP3",
		"type": "paper-conference",
		"title": "Requirements Customized Recommendation in a Decision-making System",
		"container-title": "Proceedings of the 7th International Conference on Software Engineering and New Technologies",
		"collection-title": "ICSENT 2018",
		"publisher": "ACM",
		"publisher-place": "New York, NY, USA",
		"page": "22:1–22:5",
		"source": "ACM Digital Library",
		"event-place": "New York, NY, USA",
		"abstract": "Decision-making requirements differ from one decisionmaker to another, hence the need to study decision-making requirements personalization. Customization is an effective response to the information overload problem by injecting into queries more restrictive filtering criteria, and by possibly reformulating queries to better take into account the interest centers and the decision maker preferences. The decision maker's preferences are obtained at the end of the exhaustive study of the decision-maker profile and taking into account the decision-maker's status with regard to the requested products. We have decided to improve the existent models by adding to the profile a part mentioning the decision-maker belief, which allows us to elaborate the needs personalization or to pass to the customized recommendation. To develop our proposed solution we chose the sports articles trade as a study domain.",
		"URL": "http://doi.acm.org/10.1145/3330089.3330122",
		"DOI": "10.1145/3330089.3330122",
		"ISBN": "978-1-4503-6101-9",
		"note": "event-place: Hammamet, Tunisia",
		"author": [
			{
				"family": "Abdelmadjid",
				"given": "Larbi"
			},
			{
				"family": "Mimoun",
				"given": "Malki"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2018"
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/FJJS8XDK",
		"type": "article-journal",
		"title": "A Similarity Measure Across Ontologies for Web Services Discovery",
		"container-title": "Web Services: Concepts, Methodologies, Tools, and Applications",
		"page": "859-881",
		"source": "www.igi-global.com",
		"abstract": "A Similarity Measure Across Ontologies for Web Services Discovery: 10.4018/978-1-5225-7501-6.ch047: Given the critical and difficult nature of discovering Web services in the development process of service oriented architectures, several studies have been",
		"URL": "https://www.igi-global.com/chapter/a-similarity-measure-across-ontologies-for-web-services-discovery/217867",
		"DOI": "10.4018/978-1-5225-7501-6.ch047",
		"language": "en",
		"author": [
			{
				"family": "Fellah",
				"given": "Aissa"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			},
			{
				"family": "Elci",
				"given": "Atilla"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2019"
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/DB26ZXQK",
		"type": "article-journal",
		"title": "A GPU Based Approach for Solving the Workflow Scheduling Problem",
		"container-title": "International Journal of Information Retrieval Research (IJIRR)",
		"page": "1-12",
		"volume": "9",
		"issue": "4",
		"source": "www.igi-global.com",
		"abstract": "A GPU Based Approach for Solving the Workflow Scheduling Problem: 10.4018/IJIRR.2019100101: Cloud computing is considered a new way to use on-demand computing resources. When executing a workflow process in such an environment, task scheduling, a",
		"URL": "https://www.igi-global.com/article/a-gpu-based-approach-for-solving-the-workflow-scheduling-problem/236652",
		"DOI": "10.4018/IJIRR.2019100101",
		"ISSN": "2155-6377 DOI: 10.4018/IJIRR.2019100101",
		"journalAbbreviation": "IJIRR",
		"language": "en",
		"author": [
			{
				"family": "Benhammouda",
				"given": "Mohammed"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2019",
					10,
					1
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/WCJZBYM9",
		"type": "article-journal",
		"title": "Composing WoT services with uncertain data",
		"container-title": "Future Generation Computer Systems",
		"page": "940-950",
		"volume": "101",
		"source": "ScienceDirect",
		"abstract": "The Web of Things (WoT) represents a set of technologies that allow everyday objects to connect to the Web. Often, the creation of new applications requires the composition of multiple objects. However, the interconnection of these objects poses a great problem of heterogeneity. In this paper, we propose to use WoT services as a solution to the heterogeneity problem, such that the composition of connected objects (things) will become a composition of WoT services. During the composition process, data exchanged between WoT services is often uncertain due to various reasons. To handle the problem of data uncertainty, we propose a probabilistic approach to model and evaluate WoT service composition. We also propose an efficient algorithm to execute uncertain WoT service compositions. Our proposal is implemented and evaluated, and the results of the evaluation prove the scalability and efficiency of our approach.",
		"URL": "http://www.sciencedirect.com/science/article/pii/S0167739X19304467",
		"DOI": "10.1016/j.future.2019.07.048",
		"ISSN": "0167-739X",
		"journalAbbreviation": "Future Generation Computer Systems",
		"language": "en",
		"author": [
			{
				"family": "Awad",
				"given": "Samir"
			},
			{
				"family": "Malki",
				"given": "Abdelhamid"
			},
			{
				"family": "Malki",
				"given": "Mimoun"
			},
			{
				"family": "Barhamgi",
				"given": "Mahmoud"
			},
			{
				"family": "Benslimane",
				"given": "Djamal"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2019",
					12,
					1
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/59PWKCCA",
		"type": "article",
		"title": "Mostefai.pdf",
		"URL": "http://rdoc.univ-sba.dz/bitstream/123456789/1448/1/Mostefai.pdf",
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/3dVBSljf/items/KBN3YDUI",
		"type": "article",
		"title": "BOUCHIHA Djelloul.pdf",
		"URL": "http://rdoc.univ-sba.dz/bitstream/123456789/389/1/BOUCHIHA%20Djelloul.pdf",
		"accessed": {
			"date-parts": [
				[
					"2019",
					11,
					8
				]
			]
		}
	}
]